app/controllers/lists_controller.rb

INSERT INTO "lists" ("name", "status", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "minha lista"], ["status", "t"], ["user_id", 1], ["created_at", "2016-06-07 00:37:58.704581"], ["updated_at", "2016-06-07 00:37:58.704581"]]
---
  def create
    @list = current_user.lists.new(list_params)

    respond_to do |format|
      if @list.save